In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.470306  0.256081  0.841812 -1.711245
B -0.536588  0.135323  1.262372 -0.949673
C  1.309049 -1.596765 -1.124641  0.348814
D -0.500297 -0.060158 -0.404939  0.480280
E  0.864555 -1.948708 -0.487185 -0.980863

In [4]:
df['W']

A    0.470306
B   -0.536588
C    1.309049
D   -0.500297
E    0.864555
Name: W, dtype: float64

In [5]:
df.W
#not recommend cause not specified

A    0.470306
B   -0.536588
C    1.309049
D   -0.500297
E    0.864555
Name: W, dtype: float64

In [7]:
df[['W', 'Z', 'X']]

          W         Z         X
A  0.470306 -1.711245  0.256081
B -0.536588 -0.949673  0.135323
C  1.309049  0.348814 -1.596765
D -0.500297  0.480280 -0.060158
E  0.864555 -0.980863 -1.948708

In [10]:
df['baru'] = df['W'] + df['Y']
df

          W         X         Y         Z      baru
A  0.470306  0.256081  0.841812 -1.711245  1.312118
B -0.536588  0.135323  1.262372 -0.949673  0.725783
C  1.309049 -1.596765 -1.124641  0.348814  0.184408
D -0.500297 -0.060158 -0.404939  0.480280 -0.905236
E  0.864555 -1.948708 -0.487185 -0.980863  0.377370

In [11]:
df.drop('baru', axis=1) #axis=0 for index, axis=1 for column
df

          W         X         Y         Z      baru
A  0.470306  0.256081  0.841812 -1.711245  1.312118
B -0.536588  0.135323  1.262372 -0.949673  0.725783
C  1.309049 -1.596765 -1.124641  0.348814  0.184408
D -0.500297 -0.060158 -0.404939  0.480280 -0.905236
E  0.864555 -1.948708 -0.487185 -0.980863  0.377370

In [12]:
df.drop('baru', axis=1, inplace=True)
df

          W         X         Y         Z
A  0.470306  0.256081  0.841812 -1.711245
B -0.536588  0.135323  1.262372 -0.949673
C  1.309049 -1.596765 -1.124641  0.348814
D -0.500297 -0.060158 -0.404939  0.480280
E  0.864555 -1.948708 -0.487185 -0.980863

In [14]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.470306  0.256081  0.841812 -1.711245
B -0.536588  0.135323  1.262372 -0.949673
C  1.309049 -1.596765 -1.124641  0.348814
D -0.500297 -0.060158 -0.404939  0.480280

In [16]:
df.loc['A']

W    0.470306
X    0.256081
Y    0.841812
Z   -1.711245
Name: A, dtype: float64

In [17]:
df.iloc[2]

W    1.309049
X   -1.596765
Y   -1.124641
Z    0.348814
Name: C, dtype: float64

In [18]:
df.loc['C', 'Z']

0.3488139143451967

In [19]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  0.470306  0.841812
B -0.536588  1.262372

In [20]:
df > 0

       W      X      Y      Z
A   True   True   True  False
B  False   True   True  False
C   True  False  False   True
D  False  False  False   True
E   True  False  False  False

In [23]:
df[df > 0 ]

          W         X         Y         Z
A  0.470306  0.256081  0.841812       NaN
B       NaN  0.135323  1.262372       NaN
C  1.309049       NaN       NaN  0.348814
D       NaN       NaN       NaN  0.480280
E  0.864555       NaN       NaN       NaN

In [24]:
df[df['W'] > 0]

          W         X         Y         Z
A  0.470306  0.256081  0.841812 -1.711245
C  1.309049 -1.596765 -1.124641  0.348814
E  0.864555 -1.948708 -0.487185 -0.980863

In [25]:
df[df['W'] > 0]['Y']

A    0.841812
C   -1.124641
E   -0.487185
Name: Y, dtype: float64

In [27]:
df[df['W'] > 0] [['Y' ,'Z']]

          Y         Z
A  0.841812 -1.711245
C -1.124641  0.348814
E -0.487185 -0.980863

In [35]:
df[(df['W'] > 0) & (df['X'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [36]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.470306  0.256081  0.841812 -1.711245
1     B -0.536588  0.135323  1.262372 -0.949673
2     C  1.309049 -1.596765 -1.124641  0.348814
3     D -0.500297 -0.060158 -0.404939  0.480280
4     E  0.864555 -1.948708 -0.487185 -0.980863

In [37]:
df['kode'] = "INA IND JPN RSA USA".split()

In [38]:
df

          W         X         Y         Z kode
A  0.470306  0.256081  0.841812 -1.711245  INA
B -0.536588  0.135323  1.262372 -0.949673  IND
C  1.309049 -1.596765 -1.124641  0.348814  JPN
D -0.500297 -0.060158 -0.404939  0.480280  RSA
E  0.864555 -1.948708 -0.487185 -0.980863  USA

In [39]:
df.set_index('kode')

             W         X         Y         Z
kode
INA   0.470306  0.256081  0.841812 -1.711245
IND  -0.536588  0.135323  1.262372 -0.949673
JPN   1.309049 -1.596765 -1.124641  0.348814
RSA  -0.500297 -0.060158 -0.404939  0.480280
USA   0.864555 -1.948708 -0.487185 -0.980863

In [40]:
df

          W         X         Y         Z kode
A  0.470306  0.256081  0.841812 -1.711245  INA
B -0.536588  0.135323  1.262372 -0.949673  IND
C  1.309049 -1.596765 -1.124641  0.348814  JPN
D -0.500297 -0.060158 -0.404939  0.480280  RSA
E  0.864555 -1.948708 -0.487185 -0.980863  USA

In [43]:
df.set_index('kode', inplace=True)

In [44]:
df

             W         X         Y         Z
kode
INA   0.470306  0.256081  0.841812 -1.711245
IND  -0.536588  0.135323  1.262372 -0.949673
JPN   1.309049 -1.596765 -1.124641  0.348814
RSA  -0.500297 -0.060158 -0.404939  0.480280
USA   0.864555 -1.948708 -0.487185 -0.980863

In [49]:
dataLabels = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels, dataValue))
data = pd.MultiIndex.from_tuples(data)

In [50]:
zip(dataLabels, dataValue)

In [51]:
list(zip(dataLabels, dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [52]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(np.random.randn(6,2), index = data, columns=['A', 'B'])

In [54]:
df

             A         B
G1 1 -1.287626  0.563137
   2 -0.416667 -0.690062
   3  0.156316 -0.414144
G2 1  0.629714 -0.631784
   2 -0.442359 -0.626334
   3 -0.994274 -0.001836

In [58]:
df.loc['G1'].loc[3]

A    0.156316
B   -0.414144
Name: 3, dtype: float64

In [59]:
df.index.names

FrozenList([None, None])

In [61]:
df.index.names = ['Group', 'Nomor']

In [62]:
df

                    A         B
Group Nomor
G1    1     -1.287626  0.563137
      2     -0.416667 -0.690062
      3      0.156316 -0.414144
G2    1      0.629714 -0.631784
      2     -0.442359 -0.626334
      3     -0.994274 -0.001836

In [63]:
df.xs('G1')

              A         B
Nomor
1     -1.287626  0.563137
2     -0.416667 -0.690062
3      0.156316 -0.414144

In [65]:
df.xs(['G2',2])

A   -0.442359
B   -0.626334
Name: (G2, 2), dtype: float64

In [67]:
df.xs(1, level='Nomor')

              A         B
Group
G1    -1.287626  0.563137
G2     0.629714 -0.631784